app/controllers/currencies_controller.rb

    def search
        @currencies = Currency.where('LOWER(name) LIKE ?', "%#{params[:search].downcase}%")
---
SELECT "currencies".* FROM "currencies" WHERE (LOWER(name) LIKE '%b%')

    def currency
        @currency ||= Currency.find(params[:id])
---
SELECT "currencies".* FROM "currencies" WHERE "currencies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]